# GetPlane Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SketchPlane..::..GetPlane Method
SketchPlane Class See Also
---
Returns the corresponding Plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Plane GetPlane()
```

Visual Basic
---
```text
Public Function GetPlane As Plane
```

Visual C++
---
```text
public:
Plane^ GetPlane()
```

# ### Return Value
The plane upon which elements created with this sketch plane will lie.
# See Also
SketchPlane Class
Autodesk.Revit.DB Namespace